MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAA288/mcu.h
extern volatile __C2FIFOCON11bits_t C2FIFOCON11bits __asm__ ("C2FIFOCON11") __attribute__((section("sfrs"), address(0xBF881610)));
extern volatile uint32_t        C2FIFOCON11CLR __attribute__((section("sfrs"),address(0xBF881614)));
extern volatile uint32_t        C2FIFOCON11SET __attribute__((section("sfrs"),address(0xBF881618)));
extern volatile uint32_t        C2FIFOCON11INV __attribute__((section("sfrs"),address(0xBF88161C)));
#define C2FIFOINT11 C2FIFOINT11
extern volatile uint32_t   C2FIFOINT11 __attribute__((section("sfrs"), address(0xBF881620)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT11bits_t;
extern volatile __C2FIFOINT11bits_t C2FIFOINT11bits __asm__ ("C2FIFOINT11") __attribute__((section("sfrs"), address(0xBF881620)));
extern volatile uint32_t        C2FIFOINT11CLR __attribute__((section("sfrs"),address(0xBF881624)));
extern volatile uint32_t        C2FIFOINT11SET __attribute__((section("sfrs"),address(0xBF881628)));
extern volatile uint32_t        C2FIFOINT11INV __attribute__((section("sfrs"),address(0xBF88162C)));
#define C2FIFOUA11 C2FIFOUA11
extern volatile uint32_t   C2FIFOUA11 __attribute__((section("sfrs"), address(0xBF881630)));
extern volatile uint32_t        C2FIFOUA11CLR __attribute__((section("sfrs"),address(0xBF881634)));
extern volatile uint32_t        C2FIFOUA11SET __attribute__((section("sfrs"),address(0xBF881638)));
extern volatile uint32_t        C2FIFOUA11INV __attribute__((section("sfrs"),address(0xBF88163C)));
#define C2FIFOCI11 C2FIFOCI11
extern volatile uint32_t   C2FIFOCI11 __attribute__((section("sfrs"), address(0xBF881640)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI11bits_t;
extern volatile __C2FIFOCI11bits_t C2FIFOCI11bits __asm__ ("C2FIFOCI11") __attribute__((section("sfrs"), address(0xBF881640)));
extern volatile uint32_t        C2FIFOCI11CLR __attribute__((section("sfrs"),address(0xBF881644)));
extern volatile uint32_t        C2FIFOCI11SET __attribute__((section("sfrs"),address(0xBF881648)));
extern volatile uint32_t        C2FIFOCI11INV __attribute__((section("sfrs"),address(0xBF88164C)));
#define C2FIFOCON12 C2FIFOCON12
extern volatile uint32_t   C2FIFOCON12 __attribute__((section("sfrs"), address(0xBF881650)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON12bits_t;
extern volatile __C2FIFOCON12bits_t C2FIFOCON12bits __asm__ ("C2FIFOCON12") __attribute__((section("sfrs"), address(0xBF881650)));
extern volatile uint32_t        C2FIFOCON12CLR __attribute__((section("sfrs"),address(0xBF881654)));
extern volatile uint32_t        C2FIFOCON12SET __attribute__((section("sfrs"),address(0xBF881658)));
extern volatile uint32_t        C2FIFOCON12INV __attribute__((section("sfrs"),address(0xBF88165C)));
#define C2FIFOINT12 C2FIFOINT12
extern volatile uint32_t   C2FIFOINT12 __attribute__((section("sfrs"), address(0xBF881660)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT12bits_t;
extern volatile __C2FIFOINT12bits_t C2FIFOINT12bits __asm__ ("C2FIFOINT12") __attribute__((section("sfrs"), address(0xBF881660)));
extern volatile uint32_t        C2FIFOINT12CLR __attribute__((section("sfrs"),address(0xBF881664)));
extern volatile uint32_t        C2FIFOINT12SET __attribute__((section("sfrs"),address(0xBF881668)));
extern volatile uint32_t        C2FIFOINT12INV __attribute__((section("sfrs"),address(0xBF88166C)));
#define C2FIFOUA12 C2FIFOUA12
extern volatile uint32_t   C2FIFOUA12 __attribute__((section("sfrs"), address(0xBF881670)));
extern volatile uint32_t        C2FIFOUA12CLR __attribute__((section("sfrs"),address(0xBF881674)));
extern volatile uint32_t        C2FIFOUA12SET __attribute__((section("sfrs"),address(0xBF881678)));
extern volatile uint32_t        C2FIFOUA12INV __attribute__((section("sfrs"),address(0xBF88167C)));
#define C2FIFOCI12 C2FIFOCI12
extern volatile uint32_t   C2FIFOCI12 __attribute__((section("sfrs"), address(0xBF881680)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI12bits_t;
extern volatile __C2FIFOCI12bits_t C2FIFOCI12bits __asm__ ("C2FIFOCI12") __attribute__((section("sfrs"), address(0xBF881680)));
extern volatile uint32_t        C2FIFOCI12CLR __attribute__((section("sfrs"),address(0xBF881684)));
extern volatile uint32_t        C2FIFOCI12SET __attribute__((section("sfrs"),address(0xBF881688)));
extern volatile uint32_t        C2FIFOCI12INV __attribute__((section("sfrs"),address(0xBF88168C)));
#define C2FIFOCON13 C2FIFOCON13
extern volatile uint32_t   C2FIFOCON13 __attribute__((section("sfrs"), address(0xBF881690)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON13bits_t;
extern volatile __C2FIFOCON13bits_t C2FIFOCON13bits __asm__ ("C2FIFOCON13") __attribute__((section("sfrs"), address(0xBF881690)));
extern volatile uint32_t        C2FIFOCON13CLR __attribute__((section("sfrs"),address(0xBF881694)));
extern volatile uint32_t        C2FIFOCON13SET __attribute__((section("sfrs"),address(0xBF881698)));
extern volatile uint32_t        C2FIFOCON13INV __attribute__((section("sfrs"),address(0xBF88169C)));
#define C2FIFOINT13 C2FIFOINT13
extern volatile uint32_t   C2FIFOINT13 __attribute__((section("sfrs"), address(0xBF8816A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT13bits_t;
extern volatile __C2FIFOINT13bits_t C2FIFOINT13bits __asm__ ("C2FIFOINT13") __attribute__((section("sfrs"), address(0xBF8816A0)));
extern volatile uint32_t        C2FIFOINT13CLR __attribute__((section("sfrs"),address(0xBF8816A4)));
extern volatile uint32_t        C2FIFOINT13SET __attribute__((section("sfrs"),address(0xBF8816A8)));
extern volatile uint32_t        C2FIFOINT13INV __attribute__((section("sfrs"),address(0xBF8816AC)));
#define C2FIFOUA13 C2FIFOUA13
extern volatile uint32_t   C2FIFOUA13 __attribute__((section("sfrs"), address(0xBF8816B0)));
extern volatile uint32_t        C2FIFOUA13CLR __attribute__((section("sfrs"),address(0xBF8816B4)));
extern volatile uint32_t        C2FIFOUA13SET __attribute__((section("sfrs"),address(0xBF8816B8)));
extern volatile uint32_t        C2FIFOUA13INV __attribute__((section("sfrs"),address(0xBF8816BC)));
#define C2FIFOCI13 C2FIFOCI13
extern volatile uint32_t   C2FIFOCI13 __attribute__((section("sfrs"), address(0xBF8816C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI13bits_t;
extern volatile __C2FIFOCI13bits_t C2FIFOCI13bits __asm__ ("C2FIFOCI13") __attribute__((section("sfrs"), address(0xBF8816C0)));
extern volatile uint32_t        C2FIFOCI13CLR __attribute__((section("sfrs"),address(0xBF8816C4)));
extern volatile uint32_t        C2FIFOCI13SET __attribute__((section("sfrs"),address(0xBF8816C8)));
extern volatile uint32_t        C2FIFOCI13INV __attribute__((section("sfrs"),address(0xBF8816CC)));
#define C2FIFOCON14 C2FIFOCON14
extern volatile uint32_t   C2FIFOCON14 __attribute__((section("sfrs"), address(0xBF8816D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON14bits_t;
