MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAA288/mcu.h
#define _DDRCMD111_CASCMD2_POSITION              0x00000016
#define _DDRCMD111_CASCMD2_MASK                  0x00400000
#define _DDRCMD111_CASCMD2_LENGTH                0x00000001

#define _DDRCMD111_WENCMD2_POSITION              0x00000017
#define _DDRCMD111_WENCMD2_MASK                  0x00800000
#define _DDRCMD111_WENCMD2_LENGTH                0x00000001

#define _DDRCMD111_MDALCMD_POSITION              0x00000018
#define _DDRCMD111_MDALCMD_MASK                  0xFF000000
#define _DDRCMD111_MDALCMD_LENGTH                0x00000008

#define _DDRCMD112_CLKENCMD1_POSITION            0x00000000
#define _DDRCMD112_CLKENCMD1_MASK                0x00000001
#define _DDRCMD112_CLKENCMD1_LENGTH              0x00000001

#define _DDRCMD112_CSCMD1_POSITION               0x00000001
#define _DDRCMD112_CSCMD1_MASK                   0x000001FE
#define _DDRCMD112_CSCMD1_LENGTH                 0x00000008

#define _DDRCMD112_RASCMD1_POSITION              0x00000009
#define _DDRCMD112_RASCMD1_MASK                  0x00000200
#define _DDRCMD112_RASCMD1_LENGTH                0x00000001

#define _DDRCMD112_CASCMD1_POSITION              0x0000000A
#define _DDRCMD112_CASCMD1_MASK                  0x00000400
#define _DDRCMD112_CASCMD1_LENGTH                0x00000001

#define _DDRCMD112_WENCMD1_POSITION              0x0000000B
#define _DDRCMD112_WENCMD1_MASK                  0x00000800
#define _DDRCMD112_WENCMD1_LENGTH                0x00000001

#define _DDRCMD112_CLKENCMD2_POSITION            0x0000000C
#define _DDRCMD112_CLKENCMD2_MASK                0x00001000
#define _DDRCMD112_CLKENCMD2_LENGTH              0x00000001

#define _DDRCMD112_CSCMD2_POSITION               0x0000000D
#define _DDRCMD112_CSCMD2_MASK                   0x001FE000
#define _DDRCMD112_CSCMD2_LENGTH                 0x00000008

#define _DDRCMD112_RASCMD2_POSITION              0x00000015
#define _DDRCMD112_RASCMD2_MASK                  0x00200000
#define _DDRCMD112_RASCMD2_LENGTH                0x00000001

#define _DDRCMD112_CASCMD2_POSITION              0x00000016
#define _DDRCMD112_CASCMD2_MASK                  0x00400000
#define _DDRCMD112_CASCMD2_LENGTH                0x00000001

#define _DDRCMD112_WENCMD2_POSITION              0x00000017
#define _DDRCMD112_WENCMD2_MASK                  0x00800000
#define _DDRCMD112_WENCMD2_LENGTH                0x00000001

#define _DDRCMD112_MDALCMD_POSITION              0x00000018
#define _DDRCMD112_MDALCMD_MASK                  0xFF000000
#define _DDRCMD112_MDALCMD_LENGTH                0x00000008

#define _DDRCMD113_CLKENCMD1_POSITION            0x00000000
#define _DDRCMD113_CLKENCMD1_MASK                0x00000001
#define _DDRCMD113_CLKENCMD1_LENGTH              0x00000001

#define _DDRCMD113_CSCMD1_POSITION               0x00000001
#define _DDRCMD113_CSCMD1_MASK                   0x000001FE
#define _DDRCMD113_CSCMD1_LENGTH                 0x00000008

#define _DDRCMD113_RASCMD1_POSITION              0x00000009
#define _DDRCMD113_RASCMD1_MASK                  0x00000200
#define _DDRCMD113_RASCMD1_LENGTH                0x00000001

#define _DDRCMD113_CASCMD1_POSITION              0x0000000A
#define _DDRCMD113_CASCMD1_MASK                  0x00000400
#define _DDRCMD113_CASCMD1_LENGTH                0x00000001

#define _DDRCMD113_WENCMD1_POSITION              0x0000000B
#define _DDRCMD113_WENCMD1_MASK                  0x00000800
#define _DDRCMD113_WENCMD1_LENGTH                0x00000001

#define _DDRCMD113_CLKENCMD2_POSITION            0x0000000C
#define _DDRCMD113_CLKENCMD2_MASK                0x00001000
#define _DDRCMD113_CLKENCMD2_LENGTH              0x00000001

#define _DDRCMD113_CSCMD2_POSITION               0x0000000D
#define _DDRCMD113_CSCMD2_MASK                   0x001FE000
#define _DDRCMD113_CSCMD2_LENGTH                 0x00000008

#define _DDRCMD113_RASCMD2_POSITION              0x00000015
#define _DDRCMD113_RASCMD2_MASK                  0x00200000
#define _DDRCMD113_RASCMD2_LENGTH                0x00000001

#define _DDRCMD113_CASCMD2_POSITION              0x00000016
#define _DDRCMD113_CASCMD2_MASK                  0x00400000
#define _DDRCMD113_CASCMD2_LENGTH                0x00000001

#define _DDRCMD113_WENCMD2_POSITION              0x00000017
#define _DDRCMD113_WENCMD2_MASK                  0x00800000
#define _DDRCMD113_WENCMD2_LENGTH                0x00000001

#define _DDRCMD113_MDALCMD_POSITION              0x00000018
#define _DDRCMD113_MDALCMD_MASK                  0xFF000000
#define _DDRCMD113_MDALCMD_LENGTH                0x00000008

#define _DDRCMD114_CLKENCMD1_POSITION            0x00000000
#define _DDRCMD114_CLKENCMD1_MASK                0x00000001
#define _DDRCMD114_CLKENCMD1_LENGTH              0x00000001

#define _DDRCMD114_CSCMD1_POSITION               0x00000001
#define _DDRCMD114_CSCMD1_MASK                   0x000001FE
#define _DDRCMD114_CSCMD1_LENGTH                 0x00000008

#define _DDRCMD114_RASCMD1_POSITION              0x00000009
#define _DDRCMD114_RASCMD1_MASK                  0x00000200
#define _DDRCMD114_RASCMD1_LENGTH                0x00000001

#define _DDRCMD114_CASCMD1_POSITION              0x0000000A
#define _DDRCMD114_CASCMD1_MASK                  0x00000400
#define _DDRCMD114_CASCMD1_LENGTH                0x00000001

#define _DDRCMD114_WENCMD1_POSITION              0x0000000B
#define _DDRCMD114_WENCMD1_MASK                  0x00000800
#define _DDRCMD114_WENCMD1_LENGTH                0x00000001

#define _DDRCMD114_CLKENCMD2_POSITION            0x0000000C
#define _DDRCMD114_CLKENCMD2_MASK                0x00001000
#define _DDRCMD114_CLKENCMD2_LENGTH              0x00000001

#define _DDRCMD114_CSCMD2_POSITION               0x0000000D
#define _DDRCMD114_CSCMD2_MASK                   0x001FE000
#define _DDRCMD114_CSCMD2_LENGTH                 0x00000008

#define _DDRCMD114_RASCMD2_POSITION              0x00000015
#define _DDRCMD114_RASCMD2_MASK                  0x00200000
#define _DDRCMD114_RASCMD2_LENGTH                0x00000001

#define _DDRCMD114_CASCMD2_POSITION              0x00000016
#define _DDRCMD114_CASCMD2_MASK                  0x00400000
#define _DDRCMD114_CASCMD2_LENGTH                0x00000001

#define _DDRCMD114_WENCMD2_POSITION              0x00000017
#define _DDRCMD114_WENCMD2_MASK                  0x00800000
#define _DDRCMD114_WENCMD2_LENGTH                0x00000001

#define _DDRCMD114_MDALCMD_POSITION              0x00000018
#define _DDRCMD114_MDALCMD_MASK                  0xFF000000
#define _DDRCMD114_MDALCMD_LENGTH                0x00000008

#define _DDRCMD115_CLKENCMD1_POSITION            0x00000000
#define _DDRCMD115_CLKENCMD1_MASK                0x00000001
#define _DDRCMD115_CLKENCMD1_LENGTH              0x00000001

#define _DDRCMD115_CSCMD1_POSITION               0x00000001
#define _DDRCMD115_CSCMD1_MASK                   0x000001FE
#define _DDRCMD115_CSCMD1_LENGTH                 0x00000008

