MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAA288/mcu.h
#define _GLCDCURDATA58_PIXEL1420_POSITION        0x0000000C
#define _GLCDCURDATA58_PIXEL1420_MASK            0x0000F000
#define _GLCDCURDATA58_PIXEL1420_LENGTH          0x00000004

#define _GLCDCURDATA58_PIXEL1419_POSITION        0x00000010
#define _GLCDCURDATA58_PIXEL1419_MASK            0x000F0000
#define _GLCDCURDATA58_PIXEL1419_LENGTH          0x00000004

#define _GLCDCURDATA58_PIXEL1418_POSITION        0x00000014
#define _GLCDCURDATA58_PIXEL1418_MASK            0x00F00000
#define _GLCDCURDATA58_PIXEL1418_LENGTH          0x00000004

#define _GLCDCURDATA58_PIXEL1417_POSITION        0x00000018
#define _GLCDCURDATA58_PIXEL1417_MASK            0x0F000000
#define _GLCDCURDATA58_PIXEL1417_LENGTH          0x00000004

#define _GLCDCURDATA58_PIXEL1416_POSITION        0x0000001C
#define _GLCDCURDATA58_PIXEL1416_MASK            0xF0000000
#define _GLCDCURDATA58_PIXEL1416_LENGTH          0x00000004

#define _GLCDCURDATA59_PIXEL1431_POSITION        0x00000000
#define _GLCDCURDATA59_PIXEL1431_MASK            0x0000000F
#define _GLCDCURDATA59_PIXEL1431_LENGTH          0x00000004

#define _GLCDCURDATA59_PIXEL1430_POSITION        0x00000004
#define _GLCDCURDATA59_PIXEL1430_MASK            0x000000F0
#define _GLCDCURDATA59_PIXEL1430_LENGTH          0x00000004

#define _GLCDCURDATA59_PIXEL1429_POSITION        0x00000008
#define _GLCDCURDATA59_PIXEL1429_MASK            0x00000F00
#define _GLCDCURDATA59_PIXEL1429_LENGTH          0x00000004

#define _GLCDCURDATA59_PIXEL1428_POSITION        0x0000000C
#define _GLCDCURDATA59_PIXEL1428_MASK            0x0000F000
#define _GLCDCURDATA59_PIXEL1428_LENGTH          0x00000004

#define _GLCDCURDATA59_PIXEL1427_POSITION        0x00000010
#define _GLCDCURDATA59_PIXEL1427_MASK            0x000F0000
#define _GLCDCURDATA59_PIXEL1427_LENGTH          0x00000004

#define _GLCDCURDATA59_PIXEL1426_POSITION        0x00000014
#define _GLCDCURDATA59_PIXEL1426_MASK            0x00F00000
#define _GLCDCURDATA59_PIXEL1426_LENGTH          0x00000004

#define _GLCDCURDATA59_PIXEL1425_POSITION        0x00000018
#define _GLCDCURDATA59_PIXEL1425_MASK            0x0F000000
#define _GLCDCURDATA59_PIXEL1425_LENGTH          0x00000004

#define _GLCDCURDATA59_PIXEL1424_POSITION        0x0000001C
#define _GLCDCURDATA59_PIXEL1424_MASK            0xF0000000
#define _GLCDCURDATA59_PIXEL1424_LENGTH          0x00000004

#define _GLCDCURDATA60_PIXEL157_POSITION         0x00000000
#define _GLCDCURDATA60_PIXEL157_MASK             0x0000000F
#define _GLCDCURDATA60_PIXEL157_LENGTH           0x00000004

#define _GLCDCURDATA60_PIXEL156_POSITION         0x00000004
#define _GLCDCURDATA60_PIXEL156_MASK             0x000000F0
#define _GLCDCURDATA60_PIXEL156_LENGTH           0x00000004

#define _GLCDCURDATA60_PIXEL155_POSITION         0x00000008
#define _GLCDCURDATA60_PIXEL155_MASK             0x00000F00
#define _GLCDCURDATA60_PIXEL155_LENGTH           0x00000004

#define _GLCDCURDATA60_PIXEL154_POSITION         0x0000000C
#define _GLCDCURDATA60_PIXEL154_MASK             0x0000F000
#define _GLCDCURDATA60_PIXEL154_LENGTH           0x00000004

#define _GLCDCURDATA60_PIXEL153_POSITION         0x00000010
#define _GLCDCURDATA60_PIXEL153_MASK             0x000F0000
#define _GLCDCURDATA60_PIXEL153_LENGTH           0x00000004

#define _GLCDCURDATA60_PIXEL152_POSITION         0x00000014
#define _GLCDCURDATA60_PIXEL152_MASK             0x00F00000
#define _GLCDCURDATA60_PIXEL152_LENGTH           0x00000004

#define _GLCDCURDATA60_PIXEL151_POSITION         0x00000018
#define _GLCDCURDATA60_PIXEL151_MASK             0x0F000000
#define _GLCDCURDATA60_PIXEL151_LENGTH           0x00000004

#define _GLCDCURDATA60_PIXEL150_POSITION         0x0000001C
#define _GLCDCURDATA60_PIXEL150_MASK             0xF0000000
#define _GLCDCURDATA60_PIXEL150_LENGTH           0x00000004

#define _GLCDCURDATA61_PIXEL1515_POSITION        0x00000000
#define _GLCDCURDATA61_PIXEL1515_MASK            0x0000000F
#define _GLCDCURDATA61_PIXEL1515_LENGTH          0x00000004

#define _GLCDCURDATA61_PIXEL1514_POSITION        0x00000004
#define _GLCDCURDATA61_PIXEL1514_MASK            0x000000F0
#define _GLCDCURDATA61_PIXEL1514_LENGTH          0x00000004

#define _GLCDCURDATA61_PIXEL1513_POSITION        0x00000008
#define _GLCDCURDATA61_PIXEL1513_MASK            0x00000F00
#define _GLCDCURDATA61_PIXEL1513_LENGTH          0x00000004

#define _GLCDCURDATA61_PIXEL1512_POSITION        0x0000000C
#define _GLCDCURDATA61_PIXEL1512_MASK            0x0000F000
#define _GLCDCURDATA61_PIXEL1512_LENGTH          0x00000004

#define _GLCDCURDATA61_PIXEL1511_POSITION        0x00000010
#define _GLCDCURDATA61_PIXEL1511_MASK            0x000F0000
#define _GLCDCURDATA61_PIXEL1511_LENGTH          0x00000004

#define _GLCDCURDATA61_PIXEL1510_POSITION        0x00000014
#define _GLCDCURDATA61_PIXEL1510_MASK            0x00F00000
#define _GLCDCURDATA61_PIXEL1510_LENGTH          0x00000004

#define _GLCDCURDATA61_PIXEL159_POSITION         0x00000018
#define _GLCDCURDATA61_PIXEL159_MASK             0x0F000000
#define _GLCDCURDATA61_PIXEL159_LENGTH           0x00000004

#define _GLCDCURDATA61_PIXEL158_POSITION         0x0000001C
#define _GLCDCURDATA61_PIXEL158_MASK             0xF0000000
#define _GLCDCURDATA61_PIXEL158_LENGTH           0x00000004

#define _GLCDCURDATA62_PIXEL1523_POSITION        0x00000000
#define _GLCDCURDATA62_PIXEL1523_MASK            0x0000000F
#define _GLCDCURDATA62_PIXEL1523_LENGTH          0x00000004

#define _GLCDCURDATA62_PIXEL1522_POSITION        0x00000004
#define _GLCDCURDATA62_PIXEL1522_MASK            0x000000F0
#define _GLCDCURDATA62_PIXEL1522_LENGTH          0x00000004

#define _GLCDCURDATA62_PIXEL1521_POSITION        0x00000008
#define _GLCDCURDATA62_PIXEL1521_MASK            0x00000F00
#define _GLCDCURDATA62_PIXEL1521_LENGTH          0x00000004

#define _GLCDCURDATA62_PIXEL1520_POSITION        0x0000000C
#define _GLCDCURDATA62_PIXEL1520_MASK            0x0000F000
#define _GLCDCURDATA62_PIXEL1520_LENGTH          0x00000004

#define _GLCDCURDATA62_PIXEL1519_POSITION        0x00000010
#define _GLCDCURDATA62_PIXEL1519_MASK            0x000F0000
#define _GLCDCURDATA62_PIXEL1519_LENGTH          0x00000004

#define _GLCDCURDATA62_PIXEL1518_POSITION        0x00000014
#define _GLCDCURDATA62_PIXEL1518_MASK            0x00F00000
#define _GLCDCURDATA62_PIXEL1518_LENGTH          0x00000004

#define _GLCDCURDATA62_PIXEL1517_POSITION        0x00000018
#define _GLCDCURDATA62_PIXEL1517_MASK            0x0F000000
#define _GLCDCURDATA62_PIXEL1517_LENGTH          0x00000004

#define _GLCDCURDATA62_PIXEL1516_POSITION        0x0000001C
#define _GLCDCURDATA62_PIXEL1516_MASK            0xF0000000
#define _GLCDCURDATA62_PIXEL1516_LENGTH          0x00000004

#define _GLCDCURDATA63_PIXEL1531_POSITION        0x00000000
#define _GLCDCURDATA63_PIXEL1531_MASK            0x0000000F
#define _GLCDCURDATA63_PIXEL1531_LENGTH          0x00000004

#define _GLCDCURDATA63_PIXEL1530_POSITION        0x00000004
#define _GLCDCURDATA63_PIXEL1530_MASK            0x000000F0
#define _GLCDCURDATA63_PIXEL1530_LENGTH          0x00000004

#define _GLCDCURDATA63_PIXEL1529_POSITION        0x00000008
#define _GLCDCURDATA63_PIXEL1529_MASK            0x00000F00
#define _GLCDCURDATA63_PIXEL1529_LENGTH          0x00000004

#define _GLCDCURDATA63_PIXEL1528_POSITION        0x0000000C
#define _GLCDCURDATA63_PIXEL1528_MASK            0x0000F000
#define _GLCDCURDATA63_PIXEL1528_LENGTH          0x00000004

#define _GLCDCURDATA63_PIXEL1527_POSITION        0x00000010
#define _GLCDCURDATA63_PIXEL1527_MASK            0x000F0000
#define _GLCDCURDATA63_PIXEL1527_LENGTH          0x00000004

#define _GLCDCURDATA63_PIXEL1526_POSITION        0x00000014
#define _GLCDCURDATA63_PIXEL1526_MASK            0x00F00000
#define _GLCDCURDATA63_PIXEL1526_LENGTH          0x00000004

#define _GLCDCURDATA63_PIXEL1525_POSITION        0x00000018
#define _GLCDCURDATA63_PIXEL1525_MASK            0x0F000000
#define _GLCDCURDATA63_PIXEL1525_LENGTH          0x00000004

#define _GLCDCURDATA63_PIXEL1524_POSITION        0x0000001C
#define _GLCDCURDATA63_PIXEL1524_MASK            0xF0000000
#define _GLCDCURDATA63_PIXEL1524_LENGTH          0x00000004

